test_new/Lagrangian/tracer/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [velocity];

omega           60 [rpm];

internalField
{
    type            coded;

    evaluate
    #{
        const dimensionedVector omega =
            $<dimensionedScalar>omega*vector(0, 0, 1);

        const dimensionedVector O(dimLength, field.mesh().bounds().midpoint());

        field = omega^(C - O);
    #};
}

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    ".*"
    {
        type            calculated;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
